{
  "name": "Conner King",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Conner King",
  "headerTaglineThree": "Graphic Designer & Software Devloper\n based in Birmingham, Alabama",
  "showBlog": true,
  "showResume": true,
  "darkMode": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/ItsKingzman"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/conner-king-3b8949114/"
    },
    {
      "id": "3",
      "title": "Personal Website",
      "link": "https://kingzmanco.com/"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "KingzmanCo",
      "description": "Online store offering a variety of custom merchandise",
      "imageSrc": "images/kngz-logo.png",
      "url": "https://kingzmanco.com/"
    },
    {
      "id": "2",
      "title": "OpenAI Pet Name Generator",
      "description": "Creative pet name generation application",
      "imageSrc": "https://images.unsplash.com/photo-1681062964769-8029d6831f04?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2776&q=80",
      "url": "https://github.com/ItsKingzman/openAI_Pet_Name_Generator"
    },
    {
      "id": "3",
      "title": "ChatGPT Trading",
      "description": "Conversational AI for trading and investment advice using OpenAI's GPT-4",
      "imageSrc": "https://images.unsplash.com/photo-1591696205602-2f950c417cb9?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1740&q=80",
      "url": "https://github.com/ItsKingzman/chatGPT-trading"
    },
    {
      "id": "4",
      "title": "Crypto",
      "description": "Cryptocurrency trading and analysis tool",
      "imageSrc": "https://images.unsplash.com/photo-1631603090989-93f9ef6f9d80?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1744&q=80",
      "url": "https://github.com/ItsKingzman/Crypto"
    },
    {
      "id": "5",
      "title": "Student Tracker 1",
      "description": "An application designed to help manage and track student-related data",
      "imageSrc": "https://images.unsplash.com/photo-1561089489-f13d5e730d72?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1548&q=80",
      "url": "https://github.com/ItsKingzman/StudentTracker1"
    },
    {
      "id": "6",
      "title": "Recipe App",
      "description": "Search recipes by ingredients, dish names, or categories",
      "imageSrc": "https://images.unsplash.com/photo-1622003275933-fc87f54913ab?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1740&q=80",
      "url": "https://github.com/ItsKingzman/recipe-app"
    },
    {
      "id": "7",
      "title": "Kepler Exoplanet Search",
      "description": "A comprehensive data analysis project that leverages Python and Jupyter Notebook to sift through NASA's Kepler dataset, ultimately identifying potential habitable exoplanets and defining the characteristics of their host stars",
      "imageSrc": "https://images.unsplash.com/photo-1460186136353-977e9d6085a1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1740&q=80",
      "url": "https://github.com/ItsKingzman/Kepler"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Graphic Design",
      "description": "Leveraging state-of-the-art tools like DALL•E 3, Adobe Photoshop, Adobe Illustrator, Canva, Midjourney, and Procreate, I offer premium graphic design services. My expertise extends to crafting custom merchandise such as shirts, hoodies, doormats, notebooks, bookmarks, and stickers. My approach combines creativity with cutting-edge technology, ensuring unique, visually striking designs that stand out in today's dynamic market."
    },
    {
      "id": "2",
      "title": "Data Analysis",
      "description": "I specialize in interpreting complex datasets to help businesses make data-driven decisions, identify trends, and optimize performance."
    },
    {
      "id": "3",
      "title": "Software Development",
      "description": "I create custom software solutions tailored to your business needs, employing the latest technologies and development methodologies for efficiency and scalability."
    },
    {
      "id": "4",
      "title": "Web Design",
      "description": "I provide bespoke web design services, creating visually appealing and user-friendly websites that enhance your online presence and drive customer engagement."
    },
    {
      "id": "5",
      "title": "QA Testing",
      "description": "I offer comprehensive QA testing services to ensure software functionality and reliability, employing a variety of testing methodologies to identify and resolve potential issues."
    }
  ],
  "aboutpara": "My extensive knowledge in graphic design, paired with a diverse skill set that ranges from programming to cryptocurrency technologies, allows me to approach challenges holistically, fostering creativity and innovation in every project. During my academic journey at the University of Montevallo, not only did I earn accolades such as making the Dean's List and the President's List, but I also delved deep into astrophysics data analysis. By leveraging Python, NumPy, and Jupyter Notebook, I successfully identified 17 habitable exoplanets from NASA's expansive Kepler dataset. This endeavor showcases my analytical capabilities, curiosity, and ability to extract meaningful insights from vast data pools. My entrepreneurial spirit is evident through my ventures like KingzmanCo, where I marry the worlds of graphic design and technology to offer cutting-edge products on Etsy. Leading this endeavor has honed my skills in trend analysis, customer engagement, and business management. Furthermore, my role at King&King Enterprises gave me a front-row seat to the world of cryptocurrency, where I ensured the seamless operation of mining machines and managed financial disbursements with precision. What truly sets me apart is my proficiency in a wide array of programming languages and tools. From developing a Go-Buffalo-based URL shortener to creating user-centric applications using Blazor and React, I constantly challenge myself to stay ahead of the curve. I take pride in my ability to bring ideas to life, and my projects, such as the real-time weather app or the comprehensive expense tracker, are a testament to this passion and capability. Joining your company is not just an opportunity for career advancement, but a chance to contribute to a forward-thinking team, bringing in fresh perspectives and innovative solutions. I believe my diverse experience, hands-on approach, and unwavering commitment to excellence make me a unique and valuable asset to your organization.",
  "resume": {
    "tagline": "I'm a graphic designer, software developer, data analyst, and prompt engineer",
    "description": "Innovative Graphic Designer and Software Developer with a robust academic foundation in computer informatics and hands-on experience in full-stack development, cryptocurrency technologies, database management, as well as graphic design. Known for my problem-solving skills, ability to tackle complex challenges, and commitment to team success. I'll start wherever I have to start. I'll park cars if I have to. The biggest part of judging character is knowing yourself, and I know this: I can do this job, I can. Give me a chance, I won't let you down.",
    "experiences": [
      {
        "id": "1",
        "dates": "June 2023 – Present",
        "type": "Full Time",
        "position": "KingzmanCo",
        "bullets": [
          "A diverse range of products including graphic tees, hoodies, doormats, notebooks, and stickers, each with unique designs.",
          "The website supports multiple languages: English, Spanish, and French.",
          "Integration with social media platforms like Twitter, Facebook, Pinterest, Instagram, and TikTok.",
          "Multiple payment options including major credit cards and digital wallets.",
          "Clear links to the website's refund policy, privacy policy, terms of service, and shipping details."
        ]
      },
      {
        "id": "2",
        "dates": "April 2013 – Present",
        "type": "Full Time",
        "position": "Self-Employed as Property Manager",
        "bullets": [
          "Managed rental properties, including handling repairs, collecting rents, and overseeing lease agreements.",
          "Responsible for property landscaping and maintenance.",
          "Acquired and maintained insurance policies and maintenance contracts to ensure compliance and property protection."
        ]
      },
      {
        "id": "3",
        "dates": "April 2013 – October 2016",
        "type": "Full Time",
        "position": "Cryptocurrency Mining Technician at King&King Enterprises LLC",
        "bullets": [
          "Managed and maintained client cryptocurrency mining machines, ensuring optimal performance and uptime.",
          "Handled weekly Bitcoin disbursements to clients, backed by comprehensive financial reporting.",
          "Continuously monitored key performance indicators, such as ROI, NPV, and net profit, to guide strategic decision-making."
        ]
      }
    ],
    "education": {
      "universityName": "The University of Montevallo",
      "universityDate": "2019-2022",
      "universityPara": "Dean's List | President's List | GPA: 3.5 | Member, University of Montevallo Computer Science Club"
    },
    "languages": ["Java", "C#", ".NET", "Python", "Golang", "R", "Ruby", "JavaScript", "TypeScript"],
    "graphic-design": ["Adobe Illustrator", "Adobe Photoshop", "Canva", "MidJourney", "Procreate"],
    "frameworks": ["React", "Angular", "NodeJs"],
    "others": ["Svelte", "Figma", "SQL", "HTML", "CSS/SCSS", "Git", "WorsPress", "Jupyter Notebook"]
  }
}
